HirokiIshiguro/rx-driver-package/source/r_rsci_iic_rx/r_rsci_iic_rx_vx.xx/r_rsci_iic_rx/src/targets/rx26t/r_rsci_iic_rx26t.c
/*----------------------------------------------------------------------------*/
/*   Array for start addresses of information for each RSCI IIC channel        */
/*----------------------------------------------------------------------------*/
const rsci_iic_hdl_t g_rsci_iic_handles[RSCI_IIC_NUM_CH_MAX] =
{
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    #if RSCI_IIC_CFG_CH8_INCLUDED
    &g_rsci_iic_ch8_ctrl,
    #else
    NULL,
    #endif
    #if RSCI_IIC_CFG_CH9_INCLUDED
    &g_rsci_iic_ch9_ctrl,
    #else
    NULL,
    #endif
    NULL,
    #if RSCI_IIC_CFG_CH11_INCLUDED
    &g_rsci_iic_ch11_ctrl,
    #else
    NULL,
    #endif
    NULL
};

/***********************************************************************************************************************
 Private global variables and functions
 **********************************************************************************************************************/
static rsci_iic_return_t rsci_iic_set_frequency (rsci_iic_info_t * p_rsci_iic_info);
static void rsci_iic_clear_ir_flag (rsci_iic_info_t * p_rsci_iic_info);

/***********************************************************************************************************************
 * Function Name: r_rsci_iic_check_arguments
 * Description  : check to parameter.
 * Arguments    : rsci_iic_info_t * p_rsci_iic_info   ; IIC Information
 *              ; rsci_iic_api_mode_t called_api      ; Internal Mode
 * Return Value : RSCI_IIC_SUCCESS                    ; Successful operation
 *              ; RSCI_IIC_ERR_INVALID_CHAN           ; channel number invalid for part
 *              : RSCI_IIC_ERR_INVALID_ARG            ; Parameter error
 **********************************************************************************************************************/
rsci_iic_return_t r_rsci_iic_check_arguments(rsci_iic_info_t * p_rsci_iic_info, rsci_iic_api_mode_t called_api)
{

    if (NULL == p_rsci_iic_info)
    {
        return RSCI_IIC_ERR_INVALID_ARG;
    }

    if (RSCI_IIC_MODE_RECEIVE == called_api)
    {

        if (((NULL == p_rsci_iic_info->p_slv_adr) || (NULL == p_rsci_iic_info->p_data2nd))
                || ((uint32_t)NULL == p_rsci_iic_info->cnt2nd))
        {
            return RSCI_IIC_ERR_INVALID_ARG;
        }

    }

    if ((RSCI_IIC_MODE_SEND == called_api) || (RSCI_IIC_MODE_RECEIVE == called_api))
    {

        if (NULL == p_rsci_iic_info->callbackfunc)
        {
            return RSCI_IIC_ERR_INVALID_ARG;
        }

    }

    if ((RSCI_IIC_NUM_CH8 != p_rsci_iic_info->ch_no) && (RSCI_IIC_NUM_CH9 != p_rsci_iic_info->ch_no)
    && (RSCI_IIC_NUM_CH11 != p_rsci_iic_info->ch_no))
    {
        return RSCI_IIC_ERR_INVALID_CHAN;
    }

    return RSCI_IIC_SUCCESS;
} /* End of function r_rsci_iic_check_arguments() */

/***********************************************************************************************************************
 * Function Name: r_rsci_iic_power_on
 * Description  : Turns on power to a RSCI_IIC channel.
 * Arguments    : channel -
 *                    Which channel to use.
 * Return Value : none
 **********************************************************************************************************************/
void r_rsci_iic_power_on(uint8_t channel)
{
    R_BSP_VOLATILE_EVENACCESS const rsci_iic_ch_rom_t * p_rom = g_rsci_iic_handles[channel]->prom;

    uint32_t mstp;
    uint32_t stop_mask;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif

    /* Enable selected RSCI_IIC Channel. */
    /* Bring module out of stop state. */
    mstp            = (*p_rom->pmstp);
    stop_mask       = p_rom->stop_mask;
    (*p_rom->pmstp) = mstp & (~stop_mask);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
} /* End of function r_rsci_iic_power_on() */

/***********************************************************************************************************************
 * Function Name: r_rsci_iic_power_off
 * Description  : Turns off power to a RSCI_IIC channel.
 * Arguments    : channel -
 *                    Which channel to use.
 * Return Value : none
 **********************************************************************************************************************/
void r_rsci_iic_power_off(uint8_t channel)
{
    R_BSP_VOLATILE_EVENACCESS const rsci_iic_ch_rom_t * p_rom = g_rsci_iic_handles[channel]->prom;
    
    uint32_t mstp;
    uint32_t stop_mask;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif

    /* Disable selected RSCI_IIC Channel. */
    /* Put module in stop state. */
    mstp            = (*p_rom->pmstp);
    stop_mask       = p_rom->stop_mask;
    (*p_rom->pmstp) = mstp | stop_mask;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
} /* End of function r_rsci_iic_power_off() */

