HirokiIshiguro/rx-driver-package/source/r_rsci_iic_rx/r_rsci_iic_rx_vx.xx/r_rsci_iic_rx/src/targets/rx26t/r_rsci_iic_rx26t.c
/***********************************************************************************************************************
 * Function Name: r_rsci_iic_io_open
 * Description  : Open Port Processing
 *                Sets ports to input mode. Ports input pull-up becomes "Off".
 * Arguments    : uint8_t port_gr      ;   port group
 *                uint8_t pin_num      ;   pin number
 * Return Value : None
 **********************************************************************************************************************/
void r_rsci_iic_io_open(uint8_t port_gr, uint8_t pin_num)
{

    R_BSP_VOLATILE_EVENACCESS uint8_t * const p_pcr = \
            (uint8_t *)((uint32_t)RSCI_IIC_PRV_PCR_BASE_REG+(uint32_t)port_gr);/* Get p_pcr */

    R_BSP_VOLATILE_EVENACCESS uint8_t * const p_pdr = \
            (uint8_t *)((uint32_t)RSCI_IIC_PRV_PDR_BASE_REG+(uint32_t)port_gr);/* Get p_pdr */

    R_BSP_VOLATILE_EVENACCESS uint8_t * const p_odr0 = \
            (uint8_t *)((uint32_t)RSCI_IIC_PRV_ODR0_BASE_REG+(uint32_t)(port_gr*2));/* Get p_odr0 */

    R_BSP_VOLATILE_EVENACCESS uint8_t * const p_odr1 = \
            (uint8_t *)((uint32_t)RSCI_IIC_PRV_ODR1_BASE_REG+(uint32_t)(port_gr*2));/* Get p_odr1 */

    R_BSP_VOLATILE_EVENACCESS uint8_t * const p_dscr = \
            (uint8_t *)((uint32_t)RSCI_IIC_PRV_DSCR_BASE_REG+(uint32_t)port_gr);/* Get p_dscr */

    /* Sets the port register */
    (*p_dscr) |= (1U<<pin_num); /* drive capacity control : High-drive output */
    (*p_pcr)  &= (~(1U<<pin_num)); /* input pull-up resister : off */
    (*p_pdr)  &= (~(1U<<pin_num)); /* input mode */

    /* Set N-channel open-drain output */
    if (pin_num <= 3)
    {
        (*p_odr0) |= (0x01 << (2*pin_num));
    }
    else
    {
        (*p_odr1) |= (0x01 << (2*(pin_num & 0x03)));
    }

    /* dummy read */
    if (*p_odr1)
    {
        R_BSP_NOP();
    }
} /* End of function r_rsci_iic_io_open() */

/***********************************************************************************************************************
 * Function Name: r_rsci_iic_init_io_register
 * Description  : Initializes RSCI_IIC register.
 * Arguments    : rsci_iic_info_t * p_rsci_iic_info     ;   IIC Information
 * Return Value : RSCI_IIC_SUCCESS                      ; Successful operation
 *              : RSCI_IIC_ERR_INVALID_ARG              ; Parameter error
 **********************************************************************************************************************/
rsci_iic_return_t r_rsci_iic_init_io_register(rsci_iic_info_t * p_rsci_iic_info)
{
    rsci_regs_t pregs = g_rsci_iic_handles[p_rsci_iic_info->ch_no]->prom->regs;

    R_BSP_VOLATILE_EVENACCESS const rsci_iic_ch_rom_t * p_rom = g_rsci_iic_handles[p_rsci_iic_info->ch_no]->prom;

    /* Sets SCLn and SDAn to non-driven state. */
    /* SCR0 -  Control Register 0
     b31:b25 Reserved - These bits are read as 0.
     b24     SSE - Valid in simple SPI Mode
     b21     TEIE - Transmit End Interrupt enable - TEI Interrupt request is enable.
     b20     TIE - Transmit Interrupt enable - TXI Interrupt request is enable.
     b19:b17 Reserved - These bits are read as 0.
     b16     RIE - Receive Interrupt enable - RXI and ERI Interrupt requests are enable.
     b15:b11 Reserved - These bits are read as 0.
     b10     IDSEL - Valid only in asynchronous mode.
     b9      DCME - Valid only in asynchronous mode.
     b8      MPIE - Valid in asynchronous mode and Manchester mode.
     b7:b5   Reserved - These bits are read as 0.
     b4      TE - Transmit Enable - Serial transmission is enabled.
     b3:1    Reserved - These bits are read as 0.
     b0      RE - Reception Enable - Serial Reception is enable. */
    /* Confirm SCR0 bits are 0 before setting. */
    pregs->SCR0.LONG = RSCI_IIC_SCR0_INIT;

    /* Sets a transfer clock. */
    /* Includes I/O register read operation at the end of the following function. */
    if (RSCI_IIC_SUCCESS != rsci_iic_set_frequency(p_rsci_iic_info))
    {
        return RSCI_IIC_ERR_INVALID_ARG;
    }

    /* Setting noise filter, communication pin status, parity check, CTS/RTS Function */
    /* SCR1 - Control register 1
     b31:b29 Reserved - These bits are read as 0.
     b28     NFEN - Digital noise filter enable.
     b27     Reserved - These bits are read as 0.
     b26:b24 NFCS - Noise Filter Clock Select.
     b23:b21 Reserved - These bits are read as 0.
     b20     HDSEL - Set to 0 in simple I2C Mode
     b19:b17 Reserved - These bits are read as 0.
     b16     LOOP - Not used in simple I2C Mode.
     b15:b14 Reserved - These bits are read as 0.
     b13     RINV - Receiver input invert.
     b12     TINV - Transmitter input invert
     b11:b10 Reserved - These bits are read as 0.
     b9      PM - Parity mode.
     b8      PE - Parity enable.
     b7:b6   Reserved - These bits are read as 0.
     b5      SPB2IO - Serial Port Break I/O.
     b4      SPB2DT - Serial Port Break Data.
     b3:b2   Reserved - These bits are read as 0.
     b1      CRSEP - CTS/RTS Seperation - Set to 0 in simple I2C Mode.
     b0      CTSE - CTS Enable. */
    pregs->SCR1.LONG     = RSCI_IIC_SCR1_INIT;
    pregs->SCR1.BIT.NFEN = p_rom->df_sel;
    pregs->SCR1.BIT.NFCS = p_rom->df_clk;

    /* Resets RSCI IIC internal status. */
    /* SISCR - I2C Clear Status Register
     b3     IICSTIFC - Clear SISR.IICSTIF Flag */
    pregs->SISCR.BIT.IICSTIFC = RSCI_IIC_STIF_CLEAR;

    /* SSCR  - Status clear register */
    pregs->SSCR.LONG = RSCI_IIC_SSCR_CLEAR; /* Ignore clearing TDRE Flag */

    return RSCI_IIC_SUCCESS;

} /* End of function r_rsci_iic_init_io_register() */

/***********************************************************************************************************************
 * Function Name: r_rsci_iic_clear_io_register
 * Description  : Reset RSCI I/O register.
 * Arguments    : rsci_iic_info_t * p_rsci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
void r_rsci_iic_clear_io_register(rsci_iic_info_t * p_rsci_iic_info)
{
    rsci_regs_t pregs = g_rsci_iic_handles[p_rsci_iic_info->ch_no]->prom->regs;

    /* Initializes RSCI I/O register */
    pregs->SCR0.LONG  = RSCI_IIC_SCR0_INIT;
    pregs->SCR2.LONG  = RSCI_IIC_SCR2_INIT;
    pregs->SCR3.LONG  = RSCI_IIC_SCR3_INIT;

