HirokiIshiguro/rx-driver-package/source/r_rsci_iic_rx/r_rsci_iic_rx_vx.xx/r_rsci_iic_rx/src/targets/rx26t/r_rsci_iic_rx26t.c
    pregs->SCR2.BIT.BRR        = RSCI_IIC_BRR_INIT;
    pregs->SCR1.LONG           = RSCI_IIC_SCR1_INIT;
    pregs->SIMR.LONG           = RSCI_IIC_SIMR_INIT;
    pregs->SISCR.BIT.IICSTIFC  = RSCI_IIC_STIF_CLEAR;

} /* End of function r_rsci_iic_clear_io_register() */

/***********************************************************************************************************************
 * Function Name: r_rsci_iic_int_disable
 * Description  : Disables interrupt.
 *              : Sets interrupt source priority.
 *              : Clears interrupt request register.
 * Arguments    : rsci_iic_info_t * p_rsci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
void r_rsci_iic_int_disable(rsci_iic_info_t * p_rsci_iic_info)
{
    R_BSP_VOLATILE_EVENACCESS const rsci_iic_ch_rom_t * p_rom = g_rsci_iic_handles[p_rsci_iic_info->ch_no]->prom;
    uint32_t ipl;
    uint8_t  icu_txi;
    uint8_t  txi_en_mask;
    uint32_t icu_tei;
    uint32_t tei_en_mask;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    /* TEI interrupt set to callback function of group interrupt in bsp */
    R_BSP_InterruptWrite(p_rom->grp_tei_def, (bsp_int_cb_t) (FIT_NO_FUNC));

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif

    /* Disables interrupt. */
    /* Disables TXI interrupt request enable register. */
    icu_txi            = (*p_rom->picu_txi);
    txi_en_mask        = p_rom->txi_en_mask;
    (*p_rom->picu_txi) = icu_txi & (~txi_en_mask);

    /* Disables TEI interrupt request enable register. */
    icu_tei            = (*p_rom->picu_tei);
    tei_en_mask        = p_rom->tei_en_mask;
    (*p_rom->picu_tei) = icu_tei & (~tei_en_mask);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    /* Clears interrupt source priority. */
    (*p_rom->pipr) = 0; /* Clears TXI interrupt source priority register. */

    /* dummy read */
    if (*p_rom->pipr)
    {
        R_BSP_NOP();
    }

    /* Disables interrupt request enable register. */
    ipl = 0; /* Clears TEI interrupt source priority register. */
    R_BSP_InterruptControl(p_rom->grp_tei_def, BSP_INT_CMD_GROUP_INTERRUPT_DISABLE, (void *) &ipl);

    /* Clears the interrupt request register. */
    rsci_iic_clear_ir_flag(p_rsci_iic_info);
} /* End of function r_rsci_iic_int_disable() */

/***********************************************************************************************************************
 * Function Name: r_rsci_iic_int_enable
 * Description  : Clears interrupt request register.
 *              : Enables interrupt.
 * Arguments    : rsci_iic_info_t * p_rsci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
void r_rsci_iic_int_enable(rsci_iic_info_t * p_rsci_iic_info)
{
    R_BSP_VOLATILE_EVENACCESS const rsci_iic_ch_rom_t * p_rom = g_rsci_iic_handles[p_rsci_iic_info->ch_no]->prom;

    uint32_t      ipl;
    bsp_int_src_t grp_tei_def;
    uint8_t       icu_txi;
    uint8_t       txi_en_mask;
    uint32_t      icu_tei;
    uint32_t      tei_en_mask;
    uint8_t       ipr_set_val;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    /* Clears the interrupt request register. */
    rsci_iic_clear_ir_flag(p_rsci_iic_info);

    /* TEI interrupt set to callback function of group interrupt in bsp */
    grp_tei_def = p_rom->grp_tei_def;

    /* Cast to bsp_int_cb_t */
    R_BSP_InterruptWrite(grp_tei_def, (bsp_int_cb_t) (*p_rom->grp_tei_func));

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif

    /* Enables interrupt. */
    /* Enables TXI interrupt request enable register. */
    icu_txi            = (*p_rom->picu_txi);
    txi_en_mask        = p_rom->txi_en_mask;
    (*p_rom->picu_txi) = icu_txi | txi_en_mask;

    /* Enables TEI interrupt request enable register. */
    icu_tei            = (*p_rom->picu_tei);
    tei_en_mask        = p_rom->tei_en_mask;
    (*p_rom->picu_tei) = icu_tei | tei_en_mask;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    /* Sets interrupt source priority. */
    ipr_set_val    = p_rom->ipr_set_val;
    (*p_rom->pipr) = ipr_set_val; /* Sets TXI interrupt source priority register. */

    /* dummy read */
    if (*p_rom->pipr)
    {
        R_BSP_NOP();
    }

    /* Enables interrupt request enable register. */
    ipl = p_rom->ipr_set_val; /* Sets TEI interrupt source priority register. */
    R_BSP_InterruptControl(p_rom->grp_tei_def, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &ipl);
} /* End of function r_rsci_iic_int_enable() */

/***********************************************************************************************************************
 * Function Name: rsci_iic_set_frequency
 * Description  : Set IIC Frequency Processing.
 *                Sets SMR,BRR registers.
 * Arguments    : rsci_iic_info_t * p_rsci_iic_info   ;   IIC Information
 * Return Value : RSCI_IIC_SUCCESS                    ; Successful operation
 *              : RSCI_IIC_ERR_INVALID_ARG            ; Parameter error
 **********************************************************************************************************************/
static rsci_iic_return_t rsci_iic_set_frequency(rsci_iic_info_t * p_rsci_iic_info)
{
    volatile uint16_t brr_n     = 32U; /* default: 64*2^(2*0-1) = 32 */
    volatile uint8_t  cks_value = 0U; /* default: PCLK/1 */
    volatile uint32_t brr_value = 0U;

    uint32_t pclk;
    uint16_t brr_n_tmp;
    uint8_t  cks_value_tmp;

